import * as React from "react";
import Stack from "@mui/material/Stack";
import ItemCard from "@/components/ItemCard";
import { useSelector, useDispatch } from "react-redux";
import ArticleDetail from "@/components/FullScreenDialog";
import { modifyArticles, SelectArticles } from "@/store/slice/pagesSlice";

export default function Articles(props) {
  const [open, setOpen] = React.useState(false);
  const items = useSelector(SelectArticles);
  const dispatch = useDispatch();

  const articles = [
    {
      id: 6,
      name: '过秦论（上篇）',
      author: '贾谊',
      dynasty: '西汉',
      passage: [
      '　　秦孝公据崤函之固，拥雍州之地，君臣固守以窥周室，有席卷天下，包举宇内，囊括四海之意，并吞八荒之心。当是时也，商君佐之，内立法度，务耕织，修守战之具；外连衡而斗诸侯。于是秦人拱手而取西河之外。', 
      '　　孝公既没，惠文、武、昭襄蒙故业，因遗策，南取汉中，西举巴、蜀，东割膏腴之地，北收要害之郡。诸侯恐惧，会盟而谋弱秦，不爱珍器重宝肥饶之地，以致天下之士，合从缔交，相与为一。当此之时，齐有孟尝，赵有平原，楚有春申，魏有信陵。此四君者，皆明智而忠信，宽厚而爱人，尊贤而重士，约从离衡，兼韩、魏、燕、楚、齐、赵、宋、卫、中山之众。于是六国之士，有甯越、徐尚、苏秦、杜赫之属为之谋，齐明、周最、陈轸、召滑、楼缓、翟景、苏厉、乐毅之徒通其意，吴起、孙膑、带佗、倪良、王廖、田忌、廉颇、赵奢之伦制其兵。尝以十倍之地，百万之众，叩关而攻秦。秦人开关延敌，九国之师，逡巡而不敢进。秦无亡矢遗镞之费，而天下诸侯已困矣。于是从散约败，争割地而赂秦。秦有余力而制其弊，追亡逐北，伏尸百万，流血漂橹。因利乘便，宰割天下，分裂山河。强国请服，弱国入朝。延及孝文王、庄襄王，享国之日浅，国家无事。',
      '　　及至始皇，奋六世之余烈，振长策而御宇内，吞二周而亡诸侯，履至尊而制六合，执敲扑而鞭笞天下，威振四海。南取百越之地，以为桂林、象郡；百越之君，俯首系颈，委命下吏。乃使蒙恬北筑长城而守藩篱，却匈奴七百余里。胡人不敢南下而牧马，士不敢弯弓而报怨。于是废先王之道，焚百家之言，以愚黔首；隳名城，杀豪杰，收天下之兵，聚之咸阳，销锋镝，铸以为金人十二，以弱天下之民。然后践华为城，因河为池，据亿丈之城，临不测之渊，以为固。良将劲弩守要害之处，信臣精卒陈利兵而谁何。天下已定，始皇之心，自以为关中之固，金城千里，子孙帝王万世之业也。',
      '　　始皇既没，余威震于殊俗。然陈涉瓮牖绳枢之子，氓隶之人，而迁徙之徒也；才能不及中人，非有仲尼、墨翟之贤，陶朱、猗顿之富；蹑足行伍之间，而倔起阡陌之中，率疲弊之卒，将数百之众，转而攻秦，斩木为兵，揭竿为旗，天下云集响应，赢粮而景从。山东豪俊遂并起而亡秦族矣。',
      '　　且夫天下非小弱也，雍州之地，崤函之固，自若也。陈涉之位，非尊于齐、楚、燕、赵、韩、魏、宋、卫、中山之君也；锄櫌棘矜，非铦于钩戟长铩也；谪戍之众，非抗于九国之师也；深谋远虑，行军用兵之道，非及乡时之士也。然而成败异变，功业相反，何也?试使山东之国与陈涉度长絜大，比权量力，则不可同年而语矣。然秦以区区之地，致万乘之势，序八州而朝同列，百有余年矣；然后以六合为家，崤函为宫；一夫作难而七庙隳，身死人手，为天下笑者，何也？仁义不施而攻守之势异也。'
      ],
      type: '古文',
    },
    {
      id: 7,
      name: '《苏武传(节选)》',
      dynasty: '两汉',
      author: '班固',
      passage:[
'　　武字子卿，少以父任，兄弟并为郎，稍迁至栘中厩监。时汉连伐胡，数通使相窥观。匈奴留汉使郭吉、路充国等前后十余辈，匈奴使来，汉亦留之以相当。天汉元年，且鞮侯单于初立，恐汉袭之，乃曰：「汉天子我丈人行也。」尽归汉使路充国等。武帝嘉其义，乃遣武以中郎将使持节送匈奴使留在汉者，因厚赂单于，答其善意。',
'　　武与副中郎将张胜及假吏常惠等募士斥候百余人俱。既至匈奴，置币遗单于；单于益骄，非汉所望也。方欲发使送武等，会缑王与长水虞常等谋反匈奴中。缑王者，昆邪王姊子也，与昆邪王俱降汉，后随浞野侯没胡中，及卫律所将降者，阴相与谋，劫单于母阏氏归汉。会武等至匈奴。虞常在汉时，素与副张胜相知，私候胜曰：「闻汉天子甚怨卫律，常能为汉伏弩射杀之，吾母与弟在汉，幸蒙其赏赐。」张胜许之，以货物与常。后月余，单于出猎，独阏氏子弟在。虞常等七十余人欲发，其一人夜亡告之。单于子弟发兵与战，缑王等皆死，虞常生得。',
'　　单于使卫律治其事。张胜闻之，恐前语发，以状语武。武曰：「事如此，此必及我，见犯乃死，重负国！」欲自杀，胜惠共止之。虞常果引张胜。单于怒，召诸贵人议，欲杀汉使者。左伊秩訾曰：「即谋单于，何以复加？宜皆降之。」单于使卫律召武受辞。武谓惠等：「屈节辱命，虽生何面目以归汉？」引佩刀自刺。卫律惊，自抱持武。驰召医，凿地为坎，置煴火，覆武其上，蹈其背，以出血。武气绝，半日复息。惠等哭，舆归营。单于壮其节，朝夕遣人候问武，而收系张胜。',
'　　武益愈。单于使使晓武，会论虞常，欲因此时降武。剑斩虞常已，律曰：「汉使张胜谋杀单于近臣，当死；单于募降者，赦罪。」举剑欲击之，胜请降。律谓武曰：「副有罪，当相坐。」武曰：「本无谋，又非亲属，何谓相坐？」复举剑拟之，武不动。律曰：「苏君，律前负汉归匈奴，幸蒙大恩，赐号称王，拥众数万，马畜弥山，富贵如此。苏君今日降，明日复然。空以身膏草野，谁复知之？」武不应。律曰：「君因我降，与君为兄弟；今不听吾计，后虽复欲见我，尚可得乎？」武骂律曰：「汝为人臣子，不顾恩义，畔主背亲，为降虏于蛮夷，何以女为见？且单于信女，使决人死生，不平心持正，反欲斗两主观祸败。南越杀汉使者，屠为九郡；宛王杀汉使者，头县北阙；朝鲜杀汉使者，即时诛灭。独匈奴未耳。若知我不降明，欲令两国相攻，匈奴之祸，从我始矣！」律知武终不可胁，白单于。单于愈益欲降之。乃幽武置大窖中，绝不饮食。天雨雪。武卧，啮雪与旃毛并咽之，数日不死。匈奴以为神，乃徙武北海上无人处，使牧羝。羝乳，乃得归。别其官属常惠等，各置他所。',
'　　武既至海上，廪食不至，掘野鼠去屮实而食之。杖汉节牧羊，卧起操持，节旄尽落。积五、六年，单于弟于靬王弋射海上。武能网纺缴，檠弓弩，于靬王爱之，给其衣食。三岁余，王病，赐武马畜、服匿、穹庐。王死后，人众徙去。其冬，丁令盗武牛羊，武复穷厄。',
'　　初，武与李陵俱为侍中。武使匈奴明年，陵降，不敢求武。久之，单于使陵至海上，为武置酒设乐。因谓武曰：「单于闻陵与子卿素厚，故使陵来说足下，虚心欲相待。终不得归汉，空自苦亡人之地，信义安所见乎？前长君为奉车，从至雍棫阳宫，扶辇下除，触柱，折辕，劾大不敬，伏剑自刎，赐钱二百万以葬。孺卿从祠河东後土，宦骑与黄门驸马争船，推堕驸马河中，溺死，宦骑亡。诏使孺卿逐捕。不得，惶恐饮药而死。来时太夫人已不幸，陵送葬至阳陵。子卿妇年少，闻已更嫁矣。独有女弟二人，两女一男，今复十余年，存亡不可知。人生如朝露，何久自苦如此？陵始降时，忽忽如狂，自痛负汉；加以老母系保宫。子卿不欲降，何以过陵？且陛下春秋高，法令亡常，大臣亡罪夷灭者数十家，安危不可知。子卿尚复谁为乎？愿听陵计，勿复有云！」',
'　　武曰：「武父子亡功德，皆为陛下所成就，位列将，爵通侯，兄弟亲近，常愿肝脑涂地。今得杀身自效，虽蒙斧钺汤镬，诚甘乐之。臣事君，犹子事父也。子为父死，亡所恨，愿无复再言。」陵与武饮数日，复曰：「子卿，壹听陵言。」武曰：「自分已死久矣！王必欲降武，请毕今日之欢，效死于前！」陵见其至诚，喟然叹曰：「嗟呼！义士！陵与卫律之罪上通于天！」因泣下沾衿，与武决去。',
'　　陵恶自赐武，使其妻赐武牛羊数十头。后陵复至北海上，语武：「区脱捕得云中生口，言太守以下吏民皆白服，曰：『上崩。』」武闻之，南乡号哭，欧血，旦夕临。数月，昭帝即位。数年，匈奴与汉和亲。汉求武等。匈奴诡言武死。后汉使复至匈奴。常惠请其守者与俱，得夜见汉使，具自陈道。教使者谓单于言：「天子射上林中，得雁足有系帛书，言武等在某泽中。」使者大喜，如惠语以让单于。单于视左右而惊，谢汉使曰：「武等实在。」于是李陵置酒贺武曰：「今足下还归，扬名于匈奴，功显于汉室，虽古竹帛所载，丹青所画，何以过子卿！陵虽驽怯，令汉且贳陵罪，全其老母，使得奋大辱之积志，庶几乎曹柯之盟。此陵宿昔之所不忘也！收族陵家，为世大戮，陵尚复何顾乎？已矣！令子卿知吾心耳！异域之人，壹别长绝！」陵起舞，歌曰：「径万里兮度沙幕，为君将兮奋匈奴。路穷绝兮矢刃摧，士众灭兮名已隤，老母已死，虽欲报恩将安归？」',
'　　陵泣下数行，因与武决。单于召会武官属，前以降及物故，凡随武还者九人。武以始元六年春至京师，诏武奉一太牢谒武帝园庙，拜为典属国，秩中二千石，赐钱二百万，公田二顷，宅一区。常惠徐圣赵终根皆拜为中郎，赐帛各二百匹。其余六人，老归家，赐钱人十万，复终身。常惠后至右将军，封列侯，自有传。武留匈奴凡十九岁，始以强壮出，及还，须发尽白。',
      ]
    },

    {
      id: 8,
      name: "细柳营",
      author: "司马迁",
      dynasty: "汉",
      passage: [
        '　　文帝之后六年，匈奴大入边。乃以宗正刘礼为将军，军霸上；祝兹侯徐厉为将军，军棘门；以河内守亚夫为将军，军细柳，以备胡。',
'　　上自劳军。至霸上及棘门军，直驰入，将以下骑送迎。已而之细柳军，军士吏被甲，锐兵刃，彀弓弩，持满。天子先驱至，不得入。先驱曰：“天子且至！”军门都尉曰：“将军令曰：‘军中闻将军令，不闻天子之诏。’”居无何，上至，又不得入。于是上乃使使持节诏将军：“吾欲入劳军。”亚夫乃传言开壁门。壁门士吏谓从属车骑曰：“将军约，军中不得驱驰。”于是天子乃按辔徐行。至营，将军亚夫持兵揖曰：“介胄之士不拜，请以军礼见。”天子为动，改容式车，使人称谢：“皇帝敬劳将军。”成礼而去。',
'　　既出军门，群臣皆惊。文帝曰：“嗟呼，此真将军矣！曩者霸上、棘门军，若儿戏耳，其将固可袭而虏也。至于亚夫，可得而犯邪？”称善者久之。',
      ],
      type: "古文",
    },

    {
      id: 9,
      name: "子虚赋",
      author: "司马相如",
      dynasty: "汉",
      passage: [
        '　　楚使子虚使于齐，王悉发车骑，与使者出田。田罢，子虚过奼乌有先生，亡是公在焉。坐定，乌有先生问曰：“今日田乐乎？”子虚曰：“乐。”“获多乎？”曰：“少。”“然则何乐？”对曰：“仆乐齐王之欲夸仆以车骑之众，而仆对以云梦之事也。”曰：“可得闻乎？”',
'　　子虚曰：“可。王车驾千乘，选徒万骑，田于海滨。列卒满泽，罘罔弥山，掩兔辚鹿，射麇脚麟。骛于盐浦，割鲜染轮。射中获多，矜而自功。顾谓仆曰：‘楚亦有平原广泽游猎之地饶乐若此者乎？楚王之猎孰与寡人乎？’仆下车对曰：‘臣，楚国之鄙人也，幸得宿卫十有余年，时从出游，游于后园，览于有无，然犹未能遍睹也，又焉足以言其外泽者乎！’齐王曰：‘虽然，略以子之所闻见而言之。’',
'　　“仆对曰：‘唯唯。臣闻楚有七泽，尝见其一，未睹其余也。臣之所见，盖特其小小耳者，名曰云梦。云梦者，方九百里，其中有山焉。其山则盘纡茀郁，隆崇嵂崒；岑崟参差，日月蔽亏；交错纠纷，上干青云；罢池陂陀，下属江河。其土则丹青赭垩，雌黄白坿，锡碧金银，众色炫耀，照烂龙鳞。其石则赤玉玫瑰，琳瑉琨吾，瑊玏玄厉，碝石碔玞。其东则有蕙圃：衡兰芷若，芎藭昌蒲，茳蓠麋芜，诸柘巴苴。其南则有平原广泽，登降陁靡，案衍坛曼。缘以大江，限以巫山。其高燥则生葴菥苞荔，薛莎青薠。其卑湿则生藏莨蒹葭，东蔷雕胡，莲藕觚卢、菴闾轩于，众物居之，不可胜图。其西则有涌泉清池，激水推移，外发芙蓉菱华，内隐钜石白沙。其中则有神龟蛟鼍，瑇瑁鳖鼋。其北则有阴林：其树楩柟豫章，桂椒木兰，蘖离朱杨，樝梨梬栗，橘柚芬芳；其上则有鹓雏孔鸾，腾远射干；其下则有白虎玄豹，蟃蜒貙犴。',
'　　‘于是乃使剸诸之伦，手格此兽。楚王乃驾驯驳之驷，乘雕玉之舆。靡鱼须之桡旃，曳明月之珠旗。建干将之雄戟，左乌号之雕弓，右夏服之劲箭。阳子骖乘，纤阿为御，案节未舒，即陵狡兽。蹴蛩蛩，辚距虚，轶野马，轊陶駼，乘遗风，射游骐。倏眒倩浰，雷动猋至，星流霆击。弓不虚发，中必决眦，洞胸达腋，绝乎心系。获若雨兽，揜草蔽地。于是楚王乃弭节俳徊，翱翔容与。览乎阴林，观壮士之暴怒，与猛兽之恐惧。徼郄受诎，殚睹众物之变态。',
'　　‘于是郑女曼姬，被阿緆，揄紵缟，杂纤罗，垂雾縠。襞积褰绉，郁桡溪谷。衯衯裶裶，扬袘戌削，蜚纤垂髾。扶与猗靡，噏呷萃蔡。下摩兰蕙，上拂羽盖。错翡翠之威蕤，缪绕玉绥。眇眇忽忽，若神仙之仿佛。',
'　　‘于是乃相与獠于蕙圃，媻珊郣窣，上乎金堤。揜翡翠，射鵕鸃。微矰出，孅缴施。弋白鹄，连鴐鹅。双鸧下，玄鹤加。怠而后发，游于清池。浮文鹢，扬旌栧。张翠帷，建羽盖。罔瑇瑁，钩紫贝。摐金鼓，吹鸣籁。榜人歌，声流喝。水虫骇，波鸿沸。涌泉起，奔扬会。礧石相击，硠硠礚礚，若雷霆之声，闻乎数百里之外。将息獠者，击灵鼓，起烽燧。车按行，骑就队。纚乎淫淫，般乎裔裔。',
'　　‘于是楚王乃登云阳之台，怕乎无为，澹乎自持，勺药之和，具而后御之。不若大王终日驰骋，曾不下舆，脟割轮焠，自以为娱。臣窃观之，齐殆不如。’于是齐王默然无以应仆也。”',
'　　乌有先生曰：“是何言之过也！足下不远千里，来贶齐国，王悉发境内之士，而备车骑之众，与使者出畋，乃欲勠力致获，以娱左右，何名为夸哉！问楚地之有无者，愿闻大国之风烈，先生之余论也。今足下不称楚王之德厚，而盛推云梦以为高，奢言淫乐而显侈靡，窃为足下不取也。必若所言，固非楚国之美也。无而言之，是害足下之信也。章君恶、伤私义，二者无一可，而先生行之，必且轻于齐而累于楚矣。且齐东陼钜海，南有琅邪；观乎成山，射乎之罘；浮勃澥，游孟诸；邪与肃慎为邻，右以汤谷为界。秋田乎青丘，彷徨乎海外。吞若云梦者八九于其胸中曾不蒂芥。若乃俶傥瑰伟，异方殊类，珍怪鸟兽，万端鳞崪充牣其中，不可胜记。禹不能名，卨不能计。然在诸侯之位，不敢言游戏之乐，苑囿之大；先生又见客，是以王辞不复，何为无以应哉！”',
      ],
      type: "古文",
    },
  ];

  const handleArticleDetail = (e) => {
    console.log(`页面打开状态为：${e}`);
    setOpen(e);
  };

  return (
    <React.Fragment>
      <img
        style={{ height: "100%", width: "100%" }}
        //src="https://img.moegirl.org.cn/common/0/05/GalaxyTrain_RabbitHouse_chino.png"
        src="https://www.zsbeike.com/imgs/H/H09345/h09345.0154.0[04c01416e0e80].jpg"
      />
      <Stack sx={{ width: "100%" }} spacing={1}>
        {articles.map((each) => (
          <ItemCard displayItem={each} setParentState={handleArticleDetail} />
        ))}
        <ArticleDetail open={open} setParentState={handleArticleDetail} />
      </Stack>
    </React.Fragment>
  );
}
